---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.ConnectorElement
source: html/9bb7d562-05cb-83e5-d92a-7c1e4a283298.htm
---
# ConnectorElement Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.